In [1]:
import numpy as np
import pandas as pd

In [2]:
x=pd.Series([10,20,30,40])
x

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
x.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
x.values

array([10, 20, 30, 40], dtype=int64)

In [5]:
x.dtype

dtype('int64')

In [6]:
data=[450,550,650]
Sales=pd.Series(data,index=['Bob','Sally','Tim'])
Sales

Bob      450
Sally    550
Tim      650
dtype: int64

In [7]:
Sales.index

Index(['Bob', 'Sally', 'Tim'], dtype='object')

In [8]:
Sales['Bob']

450

In [9]:
Sales[0]

450

In [11]:
x[2]

30

In [13]:
Sales[Sales>500]

Sally    550
Tim      650
dtype: int64

In [14]:
'Don' in Sales

False

In [16]:
650 in Sales

False

In [17]:
sales_dict=Sales.to_dict()
sales_dict

{'Bob': 450, 'Sally': 550, 'Tim': 650}

In [18]:
sales_ser=pd.Series(sales_dict)
sales_ser

Bob      450
Sally    550
Tim      650
dtype: int64

In [19]:
new_sales=pd.Series(Sales,index=['Don','Sally','Lucy','Mike','Bob'])
new_sales

Don        NaN
Sally    550.0
Lucy       NaN
Mike       NaN
Bob      450.0
dtype: float64

In [20]:
np.isnan(new_sales['Sally'])

False

In [21]:
np.isnan(new_sales)

Don       True
Sally    False
Lucy      True
Mike      True
Bob      False
dtype: bool

In [22]:
pd.isnull(new_sales)

Don       True
Sally    False
Lucy      True
Mike      True
Bob      False
dtype: bool

In [24]:
new_sales.index.name='Sales Person'
new_sales

Sales Person
Don        NaN
Sally    550.0
Lucy       NaN
Mike       NaN
Bob      450.0
dtype: float64

In [26]:
new_sales.name='Total Sales'
new_sales

Sales Person
Don        NaN
Sally    550.0
Lucy       NaN
Mike       NaN
Bob      450.0
Name: Total Sales, dtype: float64

In [29]:
data=[['Don',870],['Sally',678],['Bob',4756]]
df =pd.DataFrame(data,columns=['Name','Sales'])
df

    Name  Sales
0    Don    870
1  Sally    678
2    Bob   4756

In [31]:
df_dict=pd.DataFrame(sales_dict,index=[1])
df_dict

   Bob  Sally  Tim
1  450    550  650

In [32]:
dict_list = [{'Name':'Tom','Sales':250},{'Name':'Jane','Sales':300},{'Name':'Steve','Sales':350}
,{'Name':'Lucy','Sales':400}]
df_dict_list=pd.DataFrame(dict_list)
df_dict_list

    Name  Sales
0    Tom    250
1   Jane    300
2  Steve    350
3   Lucy    400

In [33]:
east = pd.Series([1000,1200,3400],index=['Q1','Q2','Q3'])
west = pd.Series([1100,1300,2400,3500],index=['Q1','Q2','Q3','Q4'])

In [34]:
df_region=pd.DataFrame({'East':east,'West':west})
df_region

      East  West
Q1  1000.0  1100
Q2  1200.0  1300
Q3  3400.0  2400
Q4     NaN  3500

In [37]:
years=['2015','2016','2017','2018']
df_region['years']=years
df_region

      East  West years
Q1  1000.0  1100  2015
Q2  1200.0  1300  2016
Q3  3400.0  2400  2017
Q4     NaN  3500  2018

In [38]:
df_region=df_region.set_index('years')
df_region

         East  West
years
2015   1000.0  1100
2016   1200.0  1300
2017   3400.0  2400
2018      NaN  3500

In [60]:
new_df=df_region.reindex(['2014','2015','2016','2017','2018','2019','2020'])
new_df

         East    West
years
2014      NaN     NaN
2015   1000.0  1100.0
2016   1200.0  1300.0
2017   3400.0  2400.0
2018      NaN  3500.0
2019      NaN     NaN
2020      NaN     NaN

In [63]:
new_df=new_df.reindex(columns=['East','South','West'])
new_df

         East  South    West
years
2014      NaN    NaN     NaN
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0
2019      NaN    NaN     NaN
2020      NaN    NaN     NaN

In [64]:
new_df.fillna(0)

         East  South    West
years
2014      0.0    0.0     0.0
2015   1000.0    0.0  1100.0
2016   1200.0    0.0  1300.0
2017   3400.0    0.0  2400.0
2018      0.0    0.0  3500.0
2019      0.0    0.0     0.0
2020      0.0    0.0     0.0

In [65]:
new_df.interpolate()

         East  South    West
years
2014      NaN    NaN     NaN
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018   3400.0    NaN  3500.0
2019   3400.0    NaN  3500.0
2020   3400.0    NaN  3500.0

In [45]:
new_df

         East  South    West
years
2014      NaN    NaN     NaN
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0
2019      NaN    NaN     NaN

In [47]:
new_df.dropna(thresh=1)

         East  South    West
years
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0

In [48]:
new_df.drop('2019')

         East  South    West
years
2014      NaN    NaN     NaN
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0

In [49]:
new_df['East']

years
2014       NaN
2015    1000.0
2016    1200.0
2017    3400.0
2018       NaN
2019       NaN
Name: East, dtype: float64

In [50]:
new_df.iloc[2]

East     1200.0
South       NaN
West     1300.0
Name: 2016, dtype: float64

In [52]:
new_df.loc[['2016','2019']]

         East  South    West
years
2016   1200.0    NaN  1300.0
2019      NaN    NaN     NaN

In [56]:
new_df.sort_index(ascending=False)

         East  South    West
years
2019      NaN    NaN     NaN
2018      NaN    NaN  3500.0
2017   3400.0    NaN  2400.0
2016   1200.0    NaN  1300.0
2015   1000.0    NaN  1100.0
2014      NaN    NaN     NaN

In [67]:
new_df.sort_values(by=['East'])

         East  South    West
years
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2014      NaN    NaN     NaN
2018      NaN    NaN  3500.0
2019      NaN    NaN     NaN
2020      NaN    NaN     NaN

In [79]:
iris_csv=pd.read_csv('iris.csv')
iris_csv

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [84]:
iris=pd.DataFrame(iris_csv)
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [126]:
x=iris.groupby(['species']).mean()
x

            sepal_length  sepal_width  petal_length  petal_width  Rank
species
setosa             5.006        3.418         1.464        0.244   5.6
versicolor         5.936        2.770         4.260        1.326  19.7
virginica          6.588        2.974         5.552        2.026  32.3

In [128]:
sepal=iris[['sepal_length','sepal_width','species']]
petal=iris[['petal_length','petal_width','species']]

     petal_length  petal_width    species
0             1.4          0.2     setosa
1             1.4          0.2     setosa
2             1.3          0.2     setosa
3             1.5          0.2     setosa
4             1.4          0.2     setosa
..            ...          ...        ...
145           5.2          2.3  virginica
146           5.0          1.9  virginica
147           5.2          2.0  virginica
148           5.4          2.3  virginica
149           5.1          1.8  virginica

[150 rows x 3 columns]

In [114]:
setosa=iris.loc[iris['species']=='setosa']
versicolor=iris.loc[iris['species']=='versicolor']
virginica=iris.loc[iris['species']=='virginica']

In [124]:
iris['Rank'] = iris['petal_length'].rank(method='dense')
iris.sort_values('Rank')

     sepal_length  sepal_width  petal_length  petal_width    species  Rank
22            4.6          3.6           1.0          0.2     setosa   1.0
13            4.3          3.0           1.1          0.1     setosa   2.0
14            5.8          4.0           1.2          0.2     setosa   3.0
35            5.0          3.2           1.2          0.2     setosa   3.0
36            5.5          3.5           1.3          0.2     setosa   4.0
..            ...          ...           ...          ...        ...   ...
131           7.9          3.8           6.4          2.0  virginica  40.0
105           7.6          3.0           6.6          2.1  virginica  41.0
117           7.7          3.8           6.7          2.2  virginica  42.0
122           7.7          2.8           6.7          2.0  virginica  42.0
118           7.7          2.6           6.9          2.3  virginica  43.0

[150 rows x 6 columns]

In [137]:
total=sepal.merge(petal, left_index=True,right_index=True)
total

,sepal_length,sepal_width,species_x,petal_length,petal_width,species_y
0,5.1,3.5,setosa,1.4,0.2,setosa
1,4.9,3.0,setosa,1.4,0.2,setosa
2,4.7,3.2,setosa,1.3,0.2,setosa
3,4.6,3.1,setosa,1.5,0.2,setosa
4,5.0,3.6,setosa,1.4,0.2,setosa
...,...,...,...,...,...,...
145,6.7,3.0,virginica,5.2,2.3,virginica
146,6.3,2.5,virginica,5.0,1.9,virginica
147,6.5,3.0,virginica,5.2,2.0,virginica
148,6.2,3.4,virginica,5.4,2.3,virginica
149,5.9,3.0,virginica,5.1,1.8,virginica

In [141]:
total.drop(['species_x'],axis=1)

     sepal_length  sepal_width  petal_length  petal_width  species_y
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [143]:
whole=pd.concat([setosa,versicolor,virginica])
whole

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]